[
  {
    "name": "Sangmin(Eddy) Hong",
    "desc": "is a co-founder and partner of Axiom Associates. He is a veteran investor with 20+ years of venture capital and financial advisory experience. He specializes in early-stage investments and has invested in numerous global companies, many of which have had successful IPO's and M&A's and become multibillion-dollar companies. He is also currently the CEO in Nextrans, a venture accelerator based in Korea, Vietnam and US. Eddy has received degrees from the most elite universities in South Korea, including his B.A degree in Psychology from Yonsei University and MBA from Seoul National University."
  },
  {
    "name": "Seijun Jeong",
    "desc": "is a co-founder and partner of Axiom Associates. Seijun’s philosophy on investing is not just about making money, but is about solidifying long-term synergistic relationships to build a brighter future together. An exceptional investor with numerous years of experience, he previously worked at Goldman Sachs and Anchor Equity Partners and is also a partner at Reverent Partners currently. He received his B.A. degree in Economics from University of Pennsylvania."
  },{
    "name": "Jung Yub Hyun",
    "desc": "is a co-founder and partner of Axiom Associates. Jung has been an active angel investor for numerous years, investing in +50 companies, many of which had successful IPO’s and M&A’s. He is a founder and partner of Honest Planet, a multi-national overseas & domestic distribution business with focus on e-commerce and brand IP incubation. He received his B.A. degree in Biology from University of Pennsylvania and D.M.D. degree in Dentistry from Penn Dental Medicine at University of Pennsylvania."
  },{
    "name": "Daesoon(Derek) Kim",
    "desc": "is a co-founder and partner of Axiom Associates, focusing on investments in information technology and fintech. Based on his numerous years of experience as a COO in QARA, a successful Korea-based fintech startup, he is an expert in aiding companies in both operation and technology support. He also has many years of experience in trading and angel investing. Derek received his B.S.E. degree in Systems Science and Engineering from University of Pennsylvania."
  }
]
